<!DOCTYPE html>
<html lang="en">
<head>
    <meta charset="UTF-8">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <link rel="stylesheet" href="./css/main.css" />
    <link rel="stylesheet" href="./css/menu.css" />
    <link rel="stylesheet" href="./css/artists.css" />
    <meta http-equiv="X-UA-Compatible" content="ie=edge">
    <title>artists</title>
</head>
<body>
    <section id="artists">
        <div  class="title-text">
            <p>معرفی هنرمندان</p>
            <h1>نقاش های برجسته تاریخ</h1>
        </div>
        <div class="artist-box">
            <div class="artist">
                <h1>لئوناردو داوینچی ، نابغه عصر رنسانس</h1>
                <p>لئوناردو داوینچی ( به انگلیسی : Leonardo da Vinci ) دانشمند و هنرمند ایتالیایی ، طراح، نقاش ، موسیقی‌دان ، نویسنده و مهندسی نابغه بود که با بینش عمیق، خلاقیت و عشقی که به کار خود می ورزید خالق آثاری شد که نظیرش را هنوز هم که هنوزه در جایی نمی توان یافت. این هنرمند دوره رنسانس مفهوم کامل فضا و سایه روشن را در هنر نقاشی به اوج رساند . داوینچی اولین طراح هواپیما و صدها اثر معماری دیگر به‌شمار می‌رود . با وجود اینکه بیش از ۲۵ نقاشی از او باقی نمانده ولی به‌طور گسترده او را یکی از بزرگترین نقاشان تاریخ دانسته‌اند. بیشتر دلیل شهرت جهانی لئوناردو داوینچی به‌خاطر نقاشی‌های شام آخر و مونا لیزا است.
                    شاید برای تان جالب باشد بدانید که داوینچی تحصیلات مدرسه ای نداشت اما ذهن خلاق و استعداد فوق العاده ای که در وجودش شکوفا شده بود موجب شد تا او خالق مونا لیزا (به انگلیسی: Mona Lisa )  ، معروف ترین اثر هنری عصر رنسانس باشد. داوینچی برای کشیدن تابلوی مونا لیزا را از سال ۱۵۰۳ شروع کرد و اتمام آن تا ۱۵۰۷ به طول انجامید. ابهام و راز این «خنده» پرآوازه، نتیجهٔ شیفتگی لئوناردو به سایه روشن جوّ و مهارتش در نشان دادن آن است. </p>
            </div>
            <div class="artist-img">
                <img src="./images/Leonardo.jpg">
            </div>
        </div>

        <div class="artist-box">
            <div class="artist">
                <h1>میکل آنژ ، نقاش بزرگ در جهان</h1>
                <p>میکل آنژ ( به انگلیسی: Michelangelo ) ، مجسمه ساز ، معمار و نقاش بزرگ ایتالیایی نیز بدون شک یکی از الهام بخش‌ترین و با استعدادترین هنرمندان جهان است و هر جا سخن از فرهیختگان هنر به میان بیاد نام او نیز می درخشد.استعدادهای چند جانبهٔ هنری‌اش چنان بود که از سوی خیلی از بزرگ‌ترین هنرمندان معاصر خودش و نیز برخی از بزرگ‌ترین هنرمندان تاریخ، وی را به عنوان یکی از نامزدهای الگوی مثالی یک همه‌چیزدان در نظر می‌گیرند.</p>
            </div>
            <div class="artist-img">
                <img src="./images/Michelangelo.jpg">
            </div>
        </div>

        <div class="artist-box">
            <div class="artist">
                <h1>پیکاسو ، نابغه هنر مدرن</h1>
                <p>پابلو پیکاسو ( به انگلیسی: Pablo Picasso ) ، هنرمند و نابغه اسپانیایی به عنوان یکی دیگر از هنرمند اثر گذار قرن بیستم  شناخته می‌شود. او در سبک های مختلفی نقاشی می کرد، وی در راه اندازی سبک کوبیسم نیز نقش بسزایی داشت و همچنین میتوان پیکاسو را به عنوان بنیانگذار این سبک نامید . پابلو بیشترین بهره را از زندگی خودش برد و تا زمان مرگش در ۹۱ سالگی کوشا و خلاق بود.
                    به همین دلیل اهالی هنر این هنرمند اسپانیایی تبار را بیشتر با آثار کوبیسم می شناسند. از معروف‌ترین آثار پیکاسو ، می‌توان به دوشیزگان آوینیون و گرنیکا اشاره کرد. 25 اکتبر سالروز تولد او، روز جهانی هنرمند نام گذاری شده ست. </p>
            </div>
            <div class="artist-img">
                <img src="./images/pikaso.jpg">
            </div>
        </div>

        <div class="artist-box">
            <div class="artist">
                <h1>وینسنت ونگوگ تاثیرگذارترین نقاش در جهان</h1>
                <p>
                    وینسنت ونگوگ ( به انگلیسی: Vincent van Gogh ) ، یک نقاش پست امپرسیونیسم هلندی بود، نقاش بزرگی که اغلب او را به‌ عنوان یکی از تأثیرگذارترین نقاشان در هنر غربی می شناسند. ون گوگ فعالیت هنری خود را به عنوان طراح و نقاش از سال ۱۸۸۰ (میلادی) و در سن ۲۷ سالگی آغاز کرد. وی در ابتدا تحت تأثیر نقاشی‌های هلندی از رنگ‌های تیره و اندوه‌ناک استفاده می‌کرد ؛ پس از آشنایی وی با جنبش‌های دریافتگری و نودریافتگری در پاریس پیشرفت هنری او را سرعت بخشید.
                    نقاشی‌های استادانه او در اوایل قرن 20، به علت ترسیم زیبا و هنرمندانه احساساتش، برنده جوایز ارزشمندی شد.</p>
            </div>
            <div class="artist-img">
                <img src="./images/van-Gogh.jpg">
            </div>
        </div>

        <div class="artist-box">
            <div class="artist">
                <h1>کلود مونه معروف ترین نقاش بزرگ در جهان</h1>
                <p>کلود‌‌مونه ( به انگلیسی: Claude Monet ) نقاش امپرسیونیسم فرانسوی، یکی از نقاشان معروف جنبش بیان درک افراد از طبیعت، به خصوص مناظر است. سبک امپرسیونیسم برگرفته از لغت impress به مفهوم تأثیر آنی و اثرگذاری در ذهن است .مونه مهم‌ترین نمایندهٔ این سبک به‌شمار می‌رود. آثار زیادی از وی به جای مانده و در بسیاری از نگارخانههای مهم دنیا از آن‌ها نگهداری می‌شود.
                    در زمان این هنرمند کپی کردن از شاهکارهای قدیمی بسیار رایج بود، اما او تمایل به نقاشی از مناظر اطراف خود را داشت. او اثر نور در مناظر آزاد را با ضربات سریع قلم نشان می داد.</p>
            </div>
            <div class="artist-img">
                <img src="./images/Monet.jpg">
            </div>
        </div>

    </section>
    
    <div id="side-nav">
        <nav>
            <ul>
            <li><a href="index.php">خانه</a></li>
                <li><a href="login.php">وارد شوید</a></li>
                <li><a href="artist.php">هنرمندان</a></li>
                <li><a href="about-us.php">درباره ما</a></li>
                <li><a href="logout.php">خروج</a></li>
            </ul>
        </nav>
    </div>

    <div id="menuBtn">
        <img src="./svg/btn.svg" id="menu">
    </div>

    <script>
        var menuBtn = document.getElementById("menuBtn")
        var menu = document.getElementById("menu")
        var sideNav = document.getElementById("side-nav")

        sideNav.style.right = "-200px"
        menuBtn.onclick = function(){
            if(sideNav.style.right == "-200px"){
                sideNav.style.right = "0"
                menu.src = "./svg/close.svg";
            }
            else{
                sideNav.style.right = "-200px"
                menu.src = "./svg/btn.svg";
            }
        }
    </script>
    
</body>
</html>
